open_loop_AFC/perpendicular_flap/physics-simulation-engine/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;       // latest OpenFOAM
// application     pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         8;

deltaT          0.01;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

functions
{
    #includeFunc preCICE_Adapter 
    #includeFunc probes
    #includeFunc flowRateInlet
}
