open_loop_AFC/perpendicular_flap/physics-simulation-engine/fluid-openfoam/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;
