open_loop_AFC/perpendicular_flap/physics-simulation-engine/fluid-openfoam/system/flowRateInlet
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    runTime;
writeInterval   0.01;

writeFields     false;
log             false;

fields (phi);
operation sum;

regionType  patch;

name    inlet;

// ************************************************************************* //