open_loop_AFC/perpendicular_flap/physics-simulation-engine/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../../precice-config.xml";

participant Fluid;

modules (FSI FF);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Flap;
    patches           (flap);
    locations         faceCenters;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
      Force
    );
  };

  Interface2
  {
    mesh              Fluid-Mesh-Actuator;
    patches           (inlet);
    locations         faceCenters;
    
    readData
    (
      Velocity
    );
    
    writeData
    (
    );
  };
};



FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}
