open_loop_AFC/perpendicular_flap/physics-simulation-engine/fluid-openfoam/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            probes;
libs            ("libsampling.so");

writeControl    runTime;
writeInterval   0.01;

fields (p);

probeLocations
(
    (0.4 0.05  0.5)
    (0.5 0.05  0.5)
    (0.6 0.05  0.5)
    (0.7 0.05  0.5)
    (0.8 0.05  0.5)
    (0.9 0.05  0.5)
    (0.4 0.15  0.5)
    (0.5 0.15  0.5)
    (0.6 0.15  0.5)
    (0.7 0.15  0.5)
    (0.8 0.15  0.5)
    (0.9 0.15  0.5)
    (0.4 0.25  0.5)
    (0.5 0.25  0.5)
    (0.6 0.25  0.5)
    (0.7 0.25  0.5)
    (0.8 0.25  0.5)
    (0.9 0.25  0.5)
    (0.4 0.35  0.5)
    (0.5 0.35  0.5)
    (0.6 0.35  0.5)
    (0.7 0.35  0.5)
    (0.8 0.35  0.5)
    (0.9 0.35  0.5)
    (-0.4 0.05  0.5)
    (-0.5 0.05  0.5)
    (-0.6 0.05  0.5)
    (-0.7 0.05  0.5)
    (-0.8 0.05  0.5)
    (-0.9 0.05  0.5)
    (-0.4 0.15  0.5)
    (-0.5 0.15  0.5)
    (-0.6 0.15  0.5)
    (-0.7 0.15  0.5)
    (-0.8 0.15  0.5)
    (-0.9 0.15  0.5)
    (-0.4 0.25  0.5)
    (-0.5 0.25  0.5)
    (-0.6 0.25  0.5)
    (-0.7 0.25  0.5)
    (-0.8 0.25  0.5)
    (-0.9 0.25  0.5)
    (-0.4 0.35  0.5)
    (-0.5 0.35  0.5)
    (-0.6 0.35  0.5)
    (-0.7 0.35  0.5)
    (-0.8 0.35  0.5)
    (-0.9 0.35  0.5)
    (-1.0 1.05  0.5)
    (-0.9 1.05  0.5)
    (-0.8 1.05  0.5)
    (-0.7 1.05  0.5)
    (-0.6 1.05  0.5)
    (-0.5 1.05  0.5)
    (-0.4 1.05  0.5)
    (-0.3 1.05  0.5)
    (-0.2 1.05  0.5)
    (-0.1 1.05  0.5)
    (0 1.05  0.5)
    (0.1 1.05  0.5)
    (0.2 1.05  0.5)
    (0.3 1.05  0.5)
    (0.4 1.05  0.5)
    (0.5 1.05  0.5)
    (0.6 1.05  0.5)
    (0.7 1.05  0.5)
    (0.8 1.05  0.5)
    (0.9 1.05  0.5)
    (0.1 1.05  0.5)
    (-1.0 1.15  0.5)
    (-0.9 1.15  0.5)
    (-0.8 1.15  0.5)
    (-0.7 1.15  0.5)
    (-0.6 1.15  0.5)
    (-0.5 1.15  0.5)
    (-0.4 1.15  0.5)
    (-0.3 1.15  0.5)
    (-0.2 1.15  0.5)
    (-0.1 1.15  0.5)
    (0 1.15  0.5)
    (0.1 1.15  0.5)
    (0.2 1.15  0.5)
    (0.3 1.15  0.5)
    (0.4 1.15  0.5)
    (0.5 1.15  0.5)
    (0.6 1.15  0.5)
    (0.7 1.15  0.5)
    (0.8 1.15  0.5)
    (0.9 1.15  0.5)
    (0.1 1.15  0.5)
    (-1.0 1.25  0.5)
    (-0.9 1.25  0.5)
    (-0.8 1.25  0.5)
    (-0.7 1.25  0.5)
    (-0.6 1.25  0.5)
    (-0.5 1.25  0.5)
    (-0.4 1.25  0.5)
    (-0.3 1.25  0.5)
    (-0.2 1.25  0.5)
    (-0.1 1.25  0.5)
    (0 1.25  0.5)
    (0.1 1.25  0.5)
    (0.2 1.25  0.5)
    (0.3 1.25  0.5)
    (0.4 1.25  0.5)
    (0.5 1.25  0.5)
    (0.6 1.25  0.5)
    (0.7 1.25  0.5)
    (0.8 1.25  0.5)
    (0.9 1.25  0.5)
    (0.1 1.25  0.5)
    (-1.0 1.35  0.5)
    (-0.9 1.35  0.5)
    (-0.8 1.35  0.5)
    (-0.7 1.35  0.5)
    (-0.6 1.35  0.5)
    (-0.5 1.35  0.5)
    (-0.4 1.35  0.5)
    (-0.3 1.35  0.5)
    (-0.2 1.35  0.5)
    (-0.1 1.35  0.5)
    (0 1.35  0.5)
    (0.1 1.35  0.5)
    (0.2 1.35  0.5)
    (0.3 1.35  0.5)
    (0.4 1.35  0.5)
    (0.5 1.35  0.5)
    (0.6 1.35  0.5)
    (0.7 1.35  0.5)
    (0.8 1.35  0.5)
    (0.9 1.35  0.5)
    (0.1 1.35  0.5)
    (-1.0 1.45  0.5)
    (-0.9 1.45  0.5)
    (-0.8 1.45  0.5)
    (-0.7 1.45  0.5)
    (-0.6 1.45  0.5)
    (-0.5 1.45  0.5)
    (-0.4 1.45  0.5)
    (-0.3 1.45  0.5)
    (-0.2 1.45  0.5)
    (-0.1 1.45  0.5)
    (0 1.45  0.5)
    (0.1 1.45  0.5)
    (0.2 1.45  0.5)
    (0.3 1.45  0.5)
    (0.4 1.45  0.5)
    (0.5 1.45  0.5)
    (0.6 1.45  0.5)
    (0.7 1.45  0.5)
    (0.8 1.45  0.5)
    (0.9 1.45  0.5)
    (0.1 1.45  0.5)
    (-1.0 1.55  0.5)
    (-0.9 1.55  0.5)
    (-0.8 1.55  0.5)
    (-0.7 1.55  0.5)
    (-0.6 1.55  0.5)
    (-0.5 1.55  0.5)
    (-0.4 1.55  0.5)
    (-0.3 1.55  0.5)
    (-0.2 1.55  0.5)
    (-0.1 1.55  0.5)
    (0 1.55  0.5)
    (0.1 1.55  0.5)
    (0.2 1.55  0.5)
    (0.3 1.55  0.5)
    (0.4 1.55  0.5)
    (0.5 1.55  0.5)
    (0.6 1.55  0.5)
    (0.7 1.55  0.5)
    (0.8 1.55  0.5)
    (0.9 1.55  0.5)
    (0.1 1.55  0.5)
);

// ************************************************************************* //