open_loop_AFC/perpendicular_flap/physics-simulation-engine/fluid-openfoam/system/setExprBoundaryFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprBoundaryFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U_inlet
{
    field   U;

    expressions
    (
        {
            patch   inlet;
            target  value;
            //Um 10; - maximum velocity at the center of the channel
            //H 4; - channel height
            vel { dir (1 0 0); }
            expression #{ 4*10*pos().y()*(4-pos().y())/(4*4)*$[(vector)vel.dir] #};   
        }
    );
}

// ************************************************************************* //

